'use strict';

// const defaultState = {
//     columns: [
//         {
//             id: 1,
//             title: 'В плане',
//             notes: [ 1, 2, 3 ]
//         },
//         {
//             id: 2,
//             title: 'В процессе',
//             notes: [4, 5, 6, 7]
//         },
//         {
//             id: 3,
//             title: "Завершено",
//             notes: []
//         }
//     ],
//     notes: [
//         {
//             id: 1,
//             content: 'Тут какая-та задача о чем-то интересном.'
//         },
//         {
//             id: 2,
//             content: 'А это задача о чем-то не интересном.'
//         },
//         {
//             id: 3,
//             content: 'Купить собачий корм.'
//         },
//         {
//             id: 4,
//             content: 'Тут какая-та задача о чем-то интересном.'
//         },
//         {
//             id: 5,
//             content: 'А это задача о чем-то не интересном.'
//         },
//         {
//             id: 6,
//             content: 'Купить собачий корм.'
//         },
//         {
//             id: 7,
//             content: 'Купить собачий корм.'
//         },
//     ]
    
// }


const defaultState = {
    columns: [
        {
            id: 1,
            title: 'В плане',
            notes: [ 1, 2, 3 ]
        },
        {
            id: 2,
            title: 'В процессе',
            notes: [4, 5, 6, 7]
        },
        {
            id: 3,
            title: "Завершено",
            notes: []
        }
    ],
    notes: [
        {
            id: 1,
            // content: 'Тут какая-та задача о чем-то интересном.'            
            content: 'Текст.'

        },
        {
            id: 2,
            content: 'Текст.'
            // content: 'А это задача о чем-то не интересном.'
        },
        {
            id: 3,
            content: 'Текст.'
            // content: 'Купить собачий корм.'
        },
        {
            id: 4,
            content: 'Текст.'
            // content: 'Тут какая-та задача о чем-то интересном.'
        },
        {
            id: 5,
            content: 'Текст.'
            // content: 'А это задача о чем-то не интересном.'
        },
        {
            id: 6,
            content: 'Текст.'
            // content: 'Купить собачий корм.'
        },
        {
            id: 7,
            content: 'Текст.'
            // content: 'Купить собачий корм.'
        },
    ]
    
}